# initial settings


## Configuring initial settings:
1. Configure the device name:
>> Router(config)# **hostname** _hostname_
2. Secure privileged EXEC mode:
>> Router(config)# **enable secret** _password_ 
3. Secure user EXEC mode:
>> Router(config)# **line console 0**  
>> Router(config-line)# **password** _password_  
>> Router(config-line)# **login**
4. Secure remote Telnet / SSH access:
>> Router(config-line)# **line vty 0 4**  
>> Router(config-line)# **password** _password_  
>> Router(config-line)# **login**  
>> Router(config-line)# **transport input** {**ssh** | **telnet**}
5. Secure all passwords in the config file:
>> Router(config)# **service password-encryption**
6. Provide legal notification:
>> Router(config)# **banner motd** _delimiter message delimiter_
7. Save the configuration:
>> Router# **copy running-config startup-config**


## Secure all:
+ All router access should be secured. 
+ Privileged EXEC mode provides the user with complete access to the device and its configuration, Therefore, it is the most important mode to secure.
+ The following commands secure privileged EXEC mode and user EXEC mode, enable Telnet and SSH remote access, and encrypt all plaintext (i.e., user EXEC and VTY line) passwords:
```
R1(config)# enable secret password 
R1(config)#
R1(config)# line console 0 
R1(config-line)# password cisco 
R1(config-line)# login 
R1(config-line)# exit 
R1(config)#
R1(config)# line vty 0 4 
R1(config-line)# password cisco 
R1(config-line)# login 
R1(config-line)# transport input ssh telnet 
R1(config-line)# exit 
R1(config)#
R1(config)# service password-encryption 
R1(config)#
```


## Save configuration:
+ The following command saves the configuration to NVRAM:
```
R1# copy running-config startup-config
Destination filename [startup-config]? 
Building configuration...
[OK]
R1#
```


## Tasks:
+ Enter global configuration mode to configure the name of the router as “R1”:
```
Router>enable
Router#configure terminal
Router(config)#hostname R1
```
+ Configure 'class' as the secret password:
```
R1(config)#enable secret class
```
+ Configure 'cisco' as the console line password, require users to login, and return to global configuration mode:
```
R1(config)#line console 0
R1(config-line)#password cisco
R1(config-line)#login
R1(config-line)#exit
```
+ For vty lines 0 through 4, configure 'cisco' as the password, require users to login, enable SSH and Telnet access, and return to global configuration mode:
```
R1(config)#line vty 0 4
R1(config-line)#password cisco
R1(config-line)#login
R1(config-line)#transport input ssh telnet
R1(config-line)#exit
```
+ Encrypt all clear text passwords:
```
R1(config)#service password-encryption
```


## Banner:
+ These banners warn unauthorized users that access is prohibited.


---
# Practise:

## Privileged EXEC Mode:
+ Enter privileged EXEC mode by entering the enable command:
```
Router> enable
Router#
```


## Show the configration of router:
```
Router# show running-config
```


## Display the current contents of NVRAM:
```
Router# show startup-config
```


## Display the current contents of Flash:
```
R1# show flash
```


## Save the startup configuration file to flash:
```
R1# copy startup-config flash
```


